2023-01-22-restclient.el.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Restclient.el</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Buscar..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">22 ene 2023</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2023-01-22-restclient.el.html"
          >Restclient.el</a
        >
      </h1>
      <p>Explorar servicios web HTTP REST.</p>
      <div id="outline-container-org942eea7" class="outline-2">
        <h2 id="org942eea7"># Restclient.el</h2>
        <div class="outline-text-2" id="text-org942eea7">
          <p>
            Restclient es una herramienta para explorar y probar manualmente los
            servicios web HTTP REST. Ejecuta consultas desde una hoja de
            consulta de texto sin formato y muestra los resultados como XML,
            JSON e incluso imágenes.
          </p>
        </div>
      </div>
      <div id="outline-container-orgbc4c1b1" class="outline-2">
        <h2 id="orgbc4c1b1"># Instalación</h2>
        <div class="outline-text-2" id="text-orgbc4c1b1">
          <ul class="org-ul">
            <li>
              Actualizar la lista de paquetes
              <b>M-x package-refresh-contents</b>.
            </li>

            <li>Instalar con <b>M-x package-install RET restclient RET</b>.</li>
          </ul>
        </div>
        <div id="outline-container-org4bd9dbc" class="outline-3">
          <h3 id="org4bd9dbc">Configuración básica</h3>
          <div class="outline-text-3" id="text-org4bd9dbc">
            <div class="org-src-container">
              <pre
                class="src src-elisp"
              ><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Cargar restclient</span>
(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">restclient</span>)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Asocia archivos .http con restclient-mode</span>
(add-to-list 'auto-mode-alist '(<span style="color: #98be65;">"\\.http\\'"</span> . restclient-mode))
</pre>
            </div>

            <ul class="org-ul">
              <li>
                Opcional company-restclient: para el autocompletado instalar
                <b>M-x package-install RET company-restclient RET</b>.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org5b6cf46" class="outline-3">
          <h3 id="org5b6cf46">Configuración opcional</h3>
          <div class="outline-text-3" id="text-org5b6cf46">
            <div class="org-src-container">
              <pre
                class="src src-elisp"
              >(<span style="color: #51afef;">with-eval-after-load</span> 'company
(add-to-list 'company-backends 'company-restclient))
</pre>
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-org0c57636" class="outline-2">
        <h2 id="org0c57636"># Uso</h2>
        <div class="outline-text-2" id="text-org0c57636">
          <ul class="org-ul">
            <li>
              Crear un archivo con extensión <b>.http</b> o usar un buffer en
              <b>restclient-mode</b>.
            </li>

            <li>
              Escribir las solicitudes <b>http</b> en el siguiente formato:
            </li>
          </ul>

          <div class="org-src-container">
            <pre
              class="src src-restclient"
            ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Solicitud GET</span>
<span style="color: #51afef;">GET</span> <span style="color: #c678dd;">https://jsonplaceholder.typicode.com/posts/1</span>
<span style="color: #dcaeea;">Accept</span>: <span style="color: #98be65;">application/json</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Solicitud POST</span>
<span style="color: #51afef;">POST</span> <span style="color: #c678dd;">https://jsonplaceholder.typicode.com/posts</span>
<span style="color: #dcaeea;">Content-Type</span>: <span style="color: #98be65;">application/json</span>

{
  <span style="color: #98be65;">"title"</span>: <span style="color: #98be65;">"foo"</span>,
  <span style="color: #98be65;">"body"</span>: <span style="color: #98be65;">"bar"</span>,
  <span style="color: #98be65;">"userId"</span>: 1
}
</pre>
          </div>
        </div>
        <div id="outline-container-orgaeeae23" class="outline-3">
          <h3 id="orgaeeae23">Para ejecutar una solicitud:</h3>
          <div class="outline-text-3" id="text-orgaeeae23">
            <ul class="org-ul">
              <li>Colocar el cursor dentro del bloque de la solicitud.</li>

              <li>
                Ejecutar <b>M-x restclient-http-send-current</b> o usa el atajo
                <b>C-c C-c</b>.
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-orgc5e2e01" class="outline-2">
        <h2 id="orgc5e2e01"># Caracteristicas avanzadas</h2>
        <div class="outline-text-2" id="text-orgc5e2e01"></div>
        <div id="outline-container-org947950a" class="outline-3">
          <h3 id="org947950a">Variables de entrono:</h3>
          <div class="outline-text-3" id="text-org947950a">
            <p>
              Se pueden definir variables de entorno en el archivo para
              reutilizarlas:
            </p>

            <div class="org-src-container">
              <pre class="src src-http">
:var base_url = https://jsonplaceholder.typicode.com

GET :base_url/posts/1
Accept: application/json
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org1f862f6" class="outline-3">
          <h3 id="org1f862f6">Integración con <b>json-mode</b></h3>
          <div class="outline-text-3" id="text-org1f862f6">
            <p>
              Formatear automáticamente las respuestas en formato <b>JSON</b>.
            </p>

            <ul class="org-ul">
              <li>Instalación <b>M-x package-install RET json-mode RET</b></li>
              <li>
                Configurar <b>restclient</b> para abrir automáticamente las
                respuestas <b>JSON</b> en <b>json-mode</b>:
              </li>
            </ul>

            <div class="org-src-container">
              <pre
                class="src src-elisp"
              >    (<span style="color: #51afef;">with-eval-after-load</span> 'restclient
      (add-hook 'restclient-response-loaded-hook
                (<span style="color: #51afef;">lambda</span> ()
                  (<span style="color: #51afef;">when</span>(
                    string-match-p<span style="color: #98be65;">"application/json"</span>(<span style="color: #51afef;">or</span>
(restclient-get-response-header <span style="color: #98be65;">"Content-Type"</span>) <span style="color: #98be65;">""</span>))
                    (json-mode)))))
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org2b65811" class="outline-3">
          <h3 id="org2b65811">Integración org-mode</h3>
          <div class="outline-text-3" id="text-org2b65811">
            <p>
              <b>restclient</b> se puede usar dentro de bloques de código en
              <b>org-mode</b> usando el paquete <b>ob-resclient</b>. Esto
              permite ejecutar solicitudes <b>http</b> directamente desde un
              archivo <b>org</b> y guardar los resultados.
            </p>

            <ul class="org-ul">
              <li>
                Instalación <b>M-x package-install RET ob-resclient RET</b>
              </li>

              <li>
                <p>Configuración</p>

                <p>Añadir <b>ob-resclient</b> a <b>org-babel</b></p>
              </li>
            </ul>

            <div class="org-src-container">
              <pre
                class="src src-elisp"
              >(<span style="color: #51afef;">with-eval-after-load</span> 'org
(add-to-list 'org-babel-load-languages '(restclient . t)))
</pre>
            </div>

            <ul class="org-ul">
              <li>
                <p>Uso</p>

                <p>
                  En un archivo <b>org</b>, crear un bloque de código para
                  <b>restclient</b>:
                </p>
              </li>
            </ul>

            <div class="org-src-container">
              <pre
                class="src src-restclient"
              ><span style="color: #5B6268;">#</span><span style="color: #5B6268;">+BEGIN_SRC restclient</span>
<span style="color: #51afef;">GET</span> <span style="color: #c678dd;">https://jsonplaceholder.typicode.com/posts/1</span>
<span style="color: #dcaeea;">Accept</span>: <span style="color: #98be65;">application/json</span>
<span style="color: #dcaeea;">#+END_SRC</span>

<span style="color: #dcaeea;">#+RESULTS</span><span style="color: #5B6268;">: </span><span style="color: #98be65;">   </span>

</pre>
            </div>

            <p>para enviar un token por cookie:</p>

            <div class="org-src-container">
              <pre
                class="src src-restclient"
              ><span style="color: #51afef;">GET</span> <span style="color: #c678dd;">http://localhost:4000/auth/profile</span>
<span style="color: #dcaeea;">Cookie</span>: <span style="color: #98be65;"> token=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im1hc...</span>
<span style="color: #dcaeea;">Accept</span>: <span style="color: #98be65;">application/json  </span>
</pre>
            </div>

            <p>para enviarlo por encabezados:</p>

            <div class="org-src-container">
              <pre
                class="src src-restclient"
              ><span style="color: #51afef;">GET</span> <span style="color: #c678dd;">http://localhost:4000/auth/profile</span>
<span style="color: #dcaeea;">Authorization</span>: <span style="color: #98be65;">Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im1hc...</span>
<span style="color: #dcaeea;">Accept</span>: <span style="color: #98be65;">application/json  </span>
</pre>
            </div>

            <p>para hacer un post:</p>
            <div class="org-src-container">
              <pre
                class="src src-restclient"
              ><span style="color: #51afef;">POST</span> <span style="color: #c678dd;">https://jsonplaceholder.typicode.com/posts\</span>
<span style="color: #dcaeea;">Content-Type</span>: <span style="color: #98be65;">application/json</span>
  {
     <span style="color: #98be65;">"title"</span>: <span style="color: #98be65;">"foo"</span>,
     <span style="color: #98be65;">"body"</span>: <span style="color: #98be65;">"bar"</span>,
     <span style="color: #98be65;">"userId"</span>: 1
  }

</pre>
            </div>

            <p>
              Ejecutar cada bloque con <b>C-c C-c</b> y el resultado se muestra
              en su seccion <b>RESULTS:</b> correspondiente
            </p>
          </div>
        </div>
        <div id="outline-container-org47ba8d7" class="outline-3">
          <h3 id="org47ba8d7">Integración con projectile</h3>
          <div class="outline-text-3" id="text-org47ba8d7">
            <p>
              Se puede guardar tus solicitudes <b>http</b> especificas para un
              proyecto dentro de su directorio, y acceder a ellas rapidamente.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-elisp"
              >(global-set-key (kbd <span style="color: #98be65;">"C-c p a"</span>) 
              (<span style="color: #51afef;">lambda</span> () 
                (<span style="color: #51afef;">interactive</span>)
                (projectile-find-file-in-directory <span style="color: #98be65;">"api/"</span>)))
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org630baf0" class="outline-3">
          <h3 id="org630baf0">Integración con ivy</h3>
          <div class="outline-text-3" id="text-org630baf0">
            <p>
              En ivy se puede crear un sistema de plantillas o un historial de
              solicitudes para acceder rapidamente a solicitudes frecuentes:
            </p>

            <div class="org-src-container">
              <pre
                class="src src-elisp"
              >(<span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">my-restclient-templates</span>
  '((<span style="color: #98be65;">"Get Post"</span> . <span style="color: #98be65;">"GET https://jsonplaceholder.typicode.com/posts/1\nAccept: application/json"</span>)
    (<span style="color: #98be65;">"Create Post"</span> . <span style="color: #98be65;">"POST https://jsonplaceholder.typicode.com/posts\nContent-Type: application/json\n\n{\n  \"title\": \"foo\",\n  \"body\": \"bar\",\n  \"userId\": 1\n}"</span>))
  <span style="color: #83898d;">"List of Restclient templates for quick insertion."</span>)

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my-restclient-ivy</span> ()
  <span style="color: #83898d;">"Select a Restclient template using Ivy and insert it into the current buffer."</span>
  (<span style="color: #51afef;">interactive</span>)
  (ivy-read <span style="color: #98be65;">"Restclient Templates: "</span>
            (mapcar #'car my-restclient-templates)
            <span style="color: #c678dd;">:action</span> (<span style="color: #51afef;">lambda</span> (choice)
                      (<span style="color: #51afef;">let</span> ((template (assoc choice my-restclient-templates)))
                        (<span style="color: #51afef;">when</span> template
                          (insert (cdr template)))))))
</pre>
            </div>
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
